MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB204/mcu.h
extern volatile PORTCBITS PORTCbits __attribute__((__sfr__));

#define LATC LATC
extern volatile uint16_t LATC __attribute__((__sfr__));
typedef struct tagLATCBITS {
  uint16_t LATC0:1;
  uint16_t LATC1:1;
  uint16_t LATC2:1;
  uint16_t LATC3:1;
  uint16_t LATC4:1;
  uint16_t LATC5:1;
  uint16_t LATC6:1;
  uint16_t LATC7:1;
  uint16_t LATC8:1;
  uint16_t LATC9:1;
} LATCBITS;
extern volatile LATCBITS LATCbits __attribute__((__sfr__));

#define ODCC ODCC
extern volatile uint16_t ODCC __attribute__((__sfr__));
typedef struct tagODCCBITS {
  uint16_t ODC0:1;
  uint16_t ODC1:1;
  uint16_t ODC2:1;
  uint16_t ODC3:1;
  uint16_t ODC4:1;
  uint16_t ODC5:1;
  uint16_t ODC6:1;
  uint16_t ODC7:1;
  uint16_t ODC8:1;
  uint16_t ODC9:1;
} ODCCBITS;
extern volatile ODCCBITS ODCCbits __attribute__((__sfr__));

#define ANSC ANSC
extern volatile uint16_t ANSC __attribute__((__sfr__));
__extension__ typedef struct tagANSCBITS {
  union {
    struct {
      uint16_t ANSC0:1;
      uint16_t ANSC1:1;
      uint16_t ANSC2:1;
    };
    struct {
      uint16_t ANSELC0:1;
      uint16_t ANSELC1:1;
      uint16_t ANSELC2:1;
    };
  };
} ANSCBITS;
extern volatile ANSCBITS ANSCbits __attribute__((__sfr__));

#define ANSELC ANSELC
extern volatile uint16_t ANSELC __attribute__((__sfr__));
__extension__ typedef struct tagANSELCBITS {
  union {
    struct {
      uint16_t ANSC0:1;
      uint16_t ANSC1:1;
      uint16_t ANSC2:1;
    };
    struct {
      uint16_t ANSELC0:1;
      uint16_t ANSELC1:1;
      uint16_t ANSELC2:1;
    };
  };
} ANSELCBITS;
extern volatile ANSELCBITS ANSELCbits __attribute__((__sfr__));

#define ANCFG ANCFG
extern volatile uint16_t ANCFG __attribute__((__sfr__));
typedef struct tagANCFGBITS {
  uint16_t VBGEN:1;
  uint16_t VBG2EN:1;
} ANCFGBITS;
extern volatile ANCFGBITS ANCFGbits __attribute__((__sfr__));

#define PADCFG1 PADCFG1
extern volatile uint16_t PADCFG1 __attribute__((__sfr__));
typedef struct tagPADCFG1BITS {
  uint16_t PMPTTL:1;
} PADCFG1BITS;
extern volatile PADCFG1BITS PADCFG1bits __attribute__((__sfr__));

#define CRYCON1 CRYCON1
extern volatile uint16_t CRYCON1 __attribute__((__sfr__));
__extension__ typedef struct tagCRYCON1BITS {
  union {
    struct {
      uint16_t CPHRMOD:3;
      uint16_t CPHRSEL:1;
      uint16_t OPMOD:4;
      uint16_t CRYGO:1;
      uint16_t :1;
      uint16_t FREEIE:1;
      uint16_t DONEIE:1;
      uint16_t ROLLIE:1;
      uint16_t CRYSIDL:1;
      uint16_t :1;
      uint16_t CRYON:1;
    };
    struct {
      uint16_t CPHRMOD0:1;
      uint16_t CPHRMOD1:1;
      uint16_t CPHRMOD2:1;
      uint16_t :1;
      uint16_t OPMOD0:1;
      uint16_t OPMOD1:1;
      uint16_t OPMOD2:1;
      uint16_t OPMOD3:1;
    };
  };
} CRYCON1BITS;
extern volatile CRYCON1BITS CRYCON1bits __attribute__((__sfr__));

#define CRYCONL CRYCONL
extern volatile uint16_t CRYCONL __attribute__((__sfr__));
__extension__ typedef struct tagCRYCONLBITS {
  union {
    struct {
      uint16_t CPHRMOD:3;
      uint16_t CPHRSEL:1;
      uint16_t OPMOD:4;
      uint16_t CRYGO:1;
      uint16_t :1;
      uint16_t FREEIE:1;
      uint16_t DONEIE:1;
      uint16_t ROLLIE:1;
      uint16_t CRYSIDL:1;
      uint16_t :1;
      uint16_t CRYON:1;
    };
    struct {
      uint16_t CPHRMOD0:1;
      uint16_t CPHRMOD1:1;
      uint16_t CPHRMOD2:1;
      uint16_t :1;
      uint16_t OPMOD0:1;
      uint16_t OPMOD1:1;
      uint16_t OPMOD2:1;
      uint16_t OPMOD3:1;
    };
  };
} CRYCONLBITS;
extern volatile CRYCONLBITS CRYCONLbits __attribute__((__sfr__));

#define CRYCON2 CRYCON2
extern volatile uint16_t CRYCON2 __attribute__((__sfr__));
__extension__ typedef struct tagCRYCON2BITS {
  union {
    struct {
      uint16_t KEYSRC:4;
      uint16_t :1;
      uint16_t KEYMOD:2;
      uint16_t SKEYSEL:1;
      uint16_t CTRSIZE:7;
    };
    struct {
      uint16_t KEYSRC0:1;
      uint16_t KEYSRC1:1;
      uint16_t KEYSRC2:1;
      uint16_t KEYSRC3:1;
      uint16_t :1;
      uint16_t KEYMOD0:1;
      uint16_t KEYMOD1:1;
      uint16_t :1;
      uint16_t CTRSIZE0:1;
      uint16_t CTRSIZE1:1;
      uint16_t CTRSIZE2:1;
      uint16_t CTRSIZE3:1;
      uint16_t CTRSIZE4:1;
      uint16_t CTRSIZE5:1;
      uint16_t CTRSIZE6:1;
    };
  };
} CRYCON2BITS;
extern volatile CRYCON2BITS CRYCON2bits __attribute__((__sfr__));

#define CRYCONH CRYCONH
extern volatile uint16_t CRYCONH __attribute__((__sfr__));
__extension__ typedef struct tagCRYCONHBITS {
  union {
    struct {
      uint16_t KEYSRC:4;
      uint16_t :1;
      uint16_t KEYMOD:2;
      uint16_t SKEYSEL:1;
      uint16_t CTRSIZE:7;
    };
    struct {
      uint16_t KEYSRC0:1;
      uint16_t KEYSRC1:1;
      uint16_t KEYSRC2:1;
      uint16_t KEYSRC3:1;
      uint16_t :1;
      uint16_t KEYMOD0:1;
      uint16_t KEYMOD1:1;
      uint16_t :1;
      uint16_t CTRSIZE0:1;
      uint16_t CTRSIZE1:1;
      uint16_t CTRSIZE2:1;
      uint16_t CTRSIZE3:1;
      uint16_t CTRSIZE4:1;
      uint16_t CTRSIZE5:1;
      uint16_t CTRSIZE6:1;
    };
  };
} CRYCONHBITS;
extern volatile CRYCONHBITS CRYCONHbits __attribute__((__sfr__));

#define CRYSTAT CRYSTAT
extern volatile uint16_t CRYSTAT __attribute__((__sfr__));
typedef struct tagCRYSTATBITS {
  uint16_t PGMFAIL:1;
  uint16_t KEYFAIL:1;
  uint16_t MODFAIL:1;
  uint16_t :1;
  uint16_t ROLLOVR:1;
  uint16_t CRYABRT:1;
  uint16_t TXTABSY:1;
  uint16_t CRYBSY:1;
} CRYSTATBITS;
extern volatile CRYSTATBITS CRYSTATbits __attribute__((__sfr__));

#define CRYOTP CRYOTP
extern volatile uint16_t CRYOTP __attribute__((__sfr__));
__extension__ typedef struct tagCRYOTPBITS {
  union {
    struct {
      uint16_t CRYWR:1;
      uint16_t KEYPG:4;
      uint16_t CRYREAD:1;
      uint16_t OTPIE:1;
      uint16_t PGMTST:1;
    };
    struct {
      uint16_t :1;
      uint16_t KEYPG0:1;
      uint16_t KEYPG1:1;
      uint16_t KEYPG2:1;
      uint16_t KEYPG3:1;
    };
  };
} CRYOTPBITS;
extern volatile CRYOTPBITS CRYOTPbits __attribute__((__sfr__));

#define CRYTXTA CRYTXTA
extern volatile uint16_t CRYTXTA __attribute__((__sfr__));
#define CRYTXTA0 CRYTXTA0
extern volatile uint16_t CRYTXTA0 __attribute__((__sfr__));
#define CRYTXTA1 CRYTXTA1
extern volatile uint16_t CRYTXTA1 __attribute__((__sfr__));
#define CRYTXTA2 CRYTXTA2
extern volatile uint16_t CRYTXTA2 __attribute__((__sfr__));
#define CRYTXTA3 CRYTXTA3
extern volatile uint16_t CRYTXTA3 __attribute__((__sfr__));
#define CRYTXTA4 CRYTXTA4
extern volatile uint16_t CRYTXTA4 __attribute__((__sfr__));
#define CRYTXTA5 CRYTXTA5
extern volatile uint16_t CRYTXTA5 __attribute__((__sfr__));
#define CRYTXTA6 CRYTXTA6
extern volatile uint16_t CRYTXTA6 __attribute__((__sfr__));
#define CRYTXTA7 CRYTXTA7
extern volatile uint16_t CRYTXTA7 __attribute__((__sfr__));
#define CRYKEY CRYKEY
extern volatile uint16_t CRYKEY __attribute__((__sfr__));
#define CRYKEY0 CRYKEY0
extern volatile uint16_t CRYKEY0 __attribute__((__sfr__));
#define CRYKEY1 CRYKEY1
extern volatile uint16_t CRYKEY1 __attribute__((__sfr__));
#define CRYKEY2 CRYKEY2
extern volatile uint16_t CRYKEY2 __attribute__((__sfr__));
#define CRYKEY3 CRYKEY3
extern volatile uint16_t CRYKEY3 __attribute__((__sfr__));
#define CRYKEY4 CRYKEY4
extern volatile uint16_t CRYKEY4 __attribute__((__sfr__));
#define CRYKEY5 CRYKEY5
extern volatile uint16_t CRYKEY5 __attribute__((__sfr__));
#define CRYKEY6 CRYKEY6
extern volatile uint16_t CRYKEY6 __attribute__((__sfr__));
#define CRYKEY7 CRYKEY7
extern volatile uint16_t CRYKEY7 __attribute__((__sfr__));
#define CRYKEY8 CRYKEY8
extern volatile uint16_t CRYKEY8 __attribute__((__sfr__));
#define CRYKEY9 CRYKEY9
extern volatile uint16_t CRYKEY9 __attribute__((__sfr__));
#define CRYKEY10 CRYKEY10
extern volatile uint16_t CRYKEY10 __attribute__((__sfr__));
#define CRYKEY11 CRYKEY11
extern volatile uint16_t CRYKEY11 __attribute__((__sfr__));
#define CRYKEY12 CRYKEY12
extern volatile uint16_t CRYKEY12 __attribute__((__sfr__));
#define CRYKEY13 CRYKEY13
extern volatile uint16_t CRYKEY13 __attribute__((__sfr__));
#define CRYKEY14 CRYKEY14
extern volatile uint16_t CRYKEY14 __attribute__((__sfr__));
#define CRYKEY15 CRYKEY15
extern volatile uint16_t CRYKEY15 __attribute__((__sfr__));
#define CRYTXTB CRYTXTB
extern volatile uint16_t CRYTXTB __attribute__((__sfr__));
#define CRYTXTB0 CRYTXTB0
extern volatile uint16_t CRYTXTB0 __attribute__((__sfr__));
#define CRYTXTB1 CRYTXTB1
extern volatile uint16_t CRYTXTB1 __attribute__((__sfr__));
#define CRYTXTB2 CRYTXTB2
extern volatile uint16_t CRYTXTB2 __attribute__((__sfr__));
#define CRYTXTB3 CRYTXTB3
extern volatile uint16_t CRYTXTB3 __attribute__((__sfr__));
#define CRYTXTB4 CRYTXTB4
extern volatile uint16_t CRYTXTB4 __attribute__((__sfr__));
#define CRYTXTB5 CRYTXTB5
extern volatile uint16_t CRYTXTB5 __attribute__((__sfr__));
#define CRYTXTB6 CRYTXTB6
extern volatile uint16_t CRYTXTB6 __attribute__((__sfr__));
#define CRYTXTB7 CRYTXTB7
extern volatile uint16_t CRYTXTB7 __attribute__((__sfr__));
#define CRYTXTC CRYTXTC
extern volatile uint16_t CRYTXTC __attribute__((__sfr__));
#define CRYTXTC0 CRYTXTC0
extern volatile uint16_t CRYTXTC0 __attribute__((__sfr__));
#define CRYTXTC1 CRYTXTC1
extern volatile uint16_t CRYTXTC1 __attribute__((__sfr__));
#define CRYTXTC2 CRYTXTC2
extern volatile uint16_t CRYTXTC2 __attribute__((__sfr__));
#define CRYTXTC3 CRYTXTC3
extern volatile uint16_t CRYTXTC3 __attribute__((__sfr__));
#define CRYTXTC4 CRYTXTC4
extern volatile uint16_t CRYTXTC4 __attribute__((__sfr__));
#define CRYTXTC5 CRYTXTC5
extern volatile uint16_t CRYTXTC5 __attribute__((__sfr__));
#define CRYTXTC6 CRYTXTC6
extern volatile uint16_t CRYTXTC6 __attribute__((__sfr__));
#define CRYTXTC7 CRYTXTC7
extern volatile uint16_t CRYTXTC7 __attribute__((__sfr__));
#define ADC1BUF0 ADC1BUF0
extern volatile uint16_t ADC1BUF0 __attribute__((__sfr__));
#define ADC1BUF1 ADC1BUF1
extern volatile uint16_t ADC1BUF1 __attribute__((__sfr__));
#define ADC1BUF2 ADC1BUF2
extern volatile uint16_t ADC1BUF2 __attribute__((__sfr__));
#define ADC1BUF3 ADC1BUF3
extern volatile uint16_t ADC1BUF3 __attribute__((__sfr__));
#define ADC1BUF4 ADC1BUF4
extern volatile uint16_t ADC1BUF4 __attribute__((__sfr__));
#define ADC1BUF5 ADC1BUF5
extern volatile uint16_t ADC1BUF5 __attribute__((__sfr__));
#define ADC1BUF6 ADC1BUF6
extern volatile uint16_t ADC1BUF6 __attribute__((__sfr__));
#define ADC1BUF7 ADC1BUF7
extern volatile uint16_t ADC1BUF7 __attribute__((__sfr__));
#define ADC1BUF8 ADC1BUF8
extern volatile uint16_t ADC1BUF8 __attribute__((__sfr__));
#define ADC1BUF9 ADC1BUF9
extern volatile uint16_t ADC1BUF9 __attribute__((__sfr__));
#define ADC1BUF10 ADC1BUF10
extern volatile uint16_t ADC1BUF10 __attribute__((__sfr__));
#define ADC1BUF11 ADC1BUF11
extern volatile uint16_t ADC1BUF11 __attribute__((__sfr__));
#define ADC1BUF12 ADC1BUF12
extern volatile uint16_t ADC1BUF12 __attribute__((__sfr__));
#define ADC1BUF13 ADC1BUF13
extern volatile uint16_t ADC1BUF13 __attribute__((__sfr__));
#define ADC1BUF14 ADC1BUF14
extern volatile uint16_t ADC1BUF14 __attribute__((__sfr__));
#define ADC1BUF15 ADC1BUF15
extern volatile uint16_t ADC1BUF15 __attribute__((__sfr__));
#define AD1CON1 AD1CON1
extern volatile uint16_t AD1CON1 __attribute__((__sfr__));
__extension__ typedef struct tagAD1CON1BITS {
  union {
    struct {
      uint16_t DONE:1;
      uint16_t SAMP:1;
      uint16_t ASAM:1;
      uint16_t :1;
      uint16_t SSRC:4;
      uint16_t FORM:2;
      uint16_t MODE12:1;
      uint16_t DMAEN:1;
      uint16_t DMABM:1;
      uint16_t ADSIDL:1;
      uint16_t :1;
      uint16_t ADON:1;
    };
    struct {
      uint16_t :4;
      uint16_t SSRC0:1;
      uint16_t SSRC1:1;
      uint16_t SSRC2:1;
      uint16_t SSRC3:1;
      uint16_t FORM0:1;
      uint16_t FORM1:1;
    };
  };
} AD1CON1BITS;
extern volatile AD1CON1BITS AD1CON1bits __attribute__((__sfr__));

#define AD1CON2 AD1CON2
extern volatile uint16_t AD1CON2 __attribute__((__sfr__));
__extension__ typedef struct tagAD1CON2BITS {
  union {
    struct {
      uint16_t ALTS:1;
      uint16_t BUFM:1;
      uint16_t SMPI:5;
      uint16_t BUFS:1;
      uint16_t :2;
      uint16_t CSCNA:1;
      uint16_t BUFREGEN:1;
      uint16_t OFFCAL:1;
      uint16_t NVCFG0:1;
      uint16_t PVCFG:2;
    };
    struct {
      uint16_t :2;
      uint16_t SMPI0:1;
      uint16_t SMPI1:1;
      uint16_t SMPI2:1;
      uint16_t SMPI3:1;
      uint16_t SMPI4:1;
      uint16_t :7;
      uint16_t PCVFG0:1;
      uint16_t PCVFG1:1;
    };
  };
} AD1CON2BITS;
extern volatile AD1CON2BITS AD1CON2bits __attribute__((__sfr__));

#define AD1CON3 AD1CON3
extern volatile uint16_t AD1CON3 __attribute__((__sfr__));
__extension__ typedef struct tagAD1CON3BITS {
  union {
    struct {
      uint16_t ADCS:8;
      uint16_t SAMC:5;
      uint16_t PUMPEN:1;
      uint16_t EXTSAM:1;
      uint16_t ADRC:1;
    };
    struct {
      uint16_t ADCS0:1;
      uint16_t ADCS1:1;
      uint16_t ADCS2:1;
      uint16_t ADCS3:1;
      uint16_t ADCS4:1;
      uint16_t ADCS5:1;
      uint16_t ADCS6:1;
      uint16_t ADCS7:1;
      uint16_t SAMC0:1;
      uint16_t SAMC1:1;
      uint16_t SAMC2:1;
      uint16_t SAMC3:1;
      uint16_t SAMC4:1;
    };
  };
} AD1CON3BITS;
extern volatile AD1CON3BITS AD1CON3bits __attribute__((__sfr__));

#define AD1CHS AD1CHS
extern volatile uint16_t AD1CHS __attribute__((__sfr__));
__extension__ typedef struct tagAD1CHSBITS {
  union {
    struct {
      uint16_t CH0SA:5;
      uint16_t CH0NA:3;
      uint16_t CH0SB:5;
      uint16_t CH0NB:3;
    };
    struct {
      uint16_t CH0SA0:1;
      uint16_t CH0SA1:1;
      uint16_t CH0SA2:1;
      uint16_t CH0SA3:1;
      uint16_t CH0SA4:1;
      uint16_t CH0NA0:1;
      uint16_t CH0NA1:1;
      uint16_t CH0NA2:1;
      uint16_t CH0SB0:1;
      uint16_t CH0SB1:1;
      uint16_t CH0SB2:1;
      uint16_t CH0SB3:1;
      uint16_t CH0SB4:1;
      uint16_t CH0NB0:1;
      uint16_t CH0NB1:1;
      uint16_t CH0NB2:1;
    };
  };
} AD1CHSBITS;
extern volatile AD1CHSBITS AD1CHSbits __attribute__((__sfr__));

#define AD1CHS0 AD1CHS0
extern volatile uint16_t AD1CHS0 __attribute__((__sfr__));
__extension__ typedef struct tagAD1CHS0BITS {
  union {
    struct {
      uint16_t CH0SA:5;
      uint16_t CH0NA:3;
      uint16_t CH0SB:5;
      uint16_t CH0NB:3;
    };
    struct {
      uint16_t CH0SA0:1;
      uint16_t CH0SA1:1;
      uint16_t CH0SA2:1;
      uint16_t CH0SA3:1;
      uint16_t CH0SA4:1;
      uint16_t CH0NA0:1;
      uint16_t CH0NA1:1;
      uint16_t CH0NA2:1;
      uint16_t CH0SB0:1;
      uint16_t CH0SB1:1;
      uint16_t CH0SB2:1;
      uint16_t CH0SB3:1;
      uint16_t CH0SB4:1;
      uint16_t CH0NB0:1;
      uint16_t CH0NB1:1;
      uint16_t CH0NB2:1;
    };
  };
} AD1CHS0BITS;
extern volatile AD1CHS0BITS AD1CHS0bits __attribute__((__sfr__));

#define AD1CSSH AD1CSSH
extern volatile uint16_t AD1CSSH __attribute__((__sfr__));
typedef struct tagAD1CSSHBITS {
  uint16_t :11;
  uint16_t CSS27:1;
  uint16_t CSS28:1;
  uint16_t CSS29:1;
  uint16_t CSS30:1;
  uint16_t CSS31:1;
} AD1CSSHBITS;
extern volatile AD1CSSHBITS AD1CSSHbits __attribute__((__sfr__));

#define AD1CSSL AD1CSSL
extern volatile uint16_t AD1CSSL __attribute__((__sfr__));
typedef struct tagAD1CSSLBITS {
  uint16_t CSS0:1;
  uint16_t CSS1:1;
  uint16_t CSS2:1;
  uint16_t CSS3:1;
  uint16_t CSS4:1;
  uint16_t CSS5:1;
  uint16_t CSS6:1;
  uint16_t CSS7:1;
  uint16_t :1;
  uint16_t CSS9:1;
  uint16_t CSS10:1;
  uint16_t CSS11:1;
  uint16_t CSS12:1;
  uint16_t CSS13:1;
  uint16_t CSS14:1;
} AD1CSSLBITS;
