MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB204/mcu.h
/* Generic structure of entire SFR area for each SPI module */
typedef struct tagSPI {
        uint16_t spixstat;
        uint16_t spixcon1;
        uint16_t spixcon2;
        uint16_t unused;
        uint16_t spixbuf;
} SPI, *PSPI;

#define SPIxSTATBITS SPI1STATBITS
#define SPIxCONBITS SPI1CONBITS

#define SPI1 SPI1
extern volatile SPI SPI1 __attribute__((__sfr__));

#define SPI1STATL SPI1STATL
extern volatile uint16_t SPI1STATL __attribute__((__sfr__));
typedef struct tagSPI1STATLBITS {
  uint16_t SPIRBF:1;
  uint16_t SPITBF:1;
  uint16_t :1;
  uint16_t SPITBE:1;
  uint16_t :1;
  uint16_t SPIRBE:1;
  uint16_t SPIROV:1;
  uint16_t SRMT:1;
  uint16_t SPITUR:1;
  uint16_t :2;
  uint16_t SPIBUSY:1;
  uint16_t FRMERR:1;
} SPI1STATLBITS;
extern volatile SPI1STATLBITS SPI1STATLbits __attribute__((__sfr__));


#define SPI1 SPI1
extern volatile SPI SPI1 __attribute__((__sfr__));

#define SPI1STATH SPI1STATH
extern volatile uint16_t SPI1STATH __attribute__((__sfr__));
__extension__ typedef struct tagSPI1STATHBITS {
  union {
    struct {
      uint16_t TXELM:6;
      uint16_t :2;
      uint16_t RXELM:6;
    };
    struct {
      uint16_t TXELM0:1;
      uint16_t TXELM1:1;
      uint16_t TXELM2:1;
      uint16_t TXELM3:1;
      uint16_t TXELM4:1;
      uint16_t TXELM5:1;
      uint16_t :2;
      uint16_t RXELM0:1;
      uint16_t RXELM1:1;
      uint16_t RXELM2:1;
      uint16_t RXELM3:1;
      uint16_t RXELM4:1;
      uint16_t RXELM5:1;
    };
  };
} SPI1STATHBITS;
extern volatile SPI1STATHBITS SPI1STATHbits __attribute__((__sfr__));

#define SPI1BUFL SPI1BUFL
extern volatile uint16_t SPI1BUFL __attribute__((__sfr__));
__extension__ typedef struct tagSPI1BUFLBITS {
  union {
    struct {
      uint16_t SPI1BUFL:16;
    };
    struct {
      uint16_t DATA:16;
    };
  };
} SPI1BUFLBITS;
extern volatile SPI1BUFLBITS SPI1BUFLbits __attribute__((__sfr__));

#define SPI1BUFH SPI1BUFH
extern volatile uint16_t SPI1BUFH __attribute__((__sfr__));
__extension__ typedef struct tagSPI1BUFHBITS {
  union {
    struct {
      uint16_t SPI1BUFH:16;
    };
    struct {
      uint16_t DATA:16;
    };
  };
} SPI1BUFHBITS;
extern volatile SPI1BUFHBITS SPI1BUFHbits __attribute__((__sfr__));

#define SPI1BRGL SPI1BRGL
extern volatile uint16_t SPI1BRGL __attribute__((__sfr__));
__extension__ typedef struct tagSPI1BRGLBITS {
  union {
    struct {
      uint16_t SPI1BRGL:13;
    };
    struct {
      uint16_t BRG:13;
    };
  };
} SPI1BRGLBITS;
extern volatile SPI1BRGLBITS SPI1BRGLbits __attribute__((__sfr__));

#define SPI1BRGH SPI1BRGH
extern volatile uint16_t SPI1BRGH __attribute__((__sfr__));
#define SPI1IMSK1 SPI1IMSK1
extern volatile uint16_t SPI1IMSK1 __attribute__((__sfr__));
typedef struct tagSPI1IMSK1BITS {
  uint16_t SPIRBFEN:1;
  uint16_t SPITBFEN:1;
  uint16_t :1;
  uint16_t SPITBEN:1;
  uint16_t :1;
  uint16_t SPIRBEN:1;
  uint16_t SPIROVEN:1;
  uint16_t SRMTEN:1;
  uint16_t SPITUREN:1;
  uint16_t :2;
  uint16_t BUSYEN:1;
  uint16_t FRMERREN:1;
} SPI1IMSK1BITS;
extern volatile SPI1IMSK1BITS SPI1IMSK1bits __attribute__((__sfr__));

#define SPI1IMSKL SPI1IMSKL
extern volatile uint16_t SPI1IMSKL __attribute__((__sfr__));
typedef struct tagSPI1IMSKLBITS {
  uint16_t SPIRBFEN:1;
  uint16_t SPITBFEN:1;
  uint16_t :1;
  uint16_t SPITBEN:1;
  uint16_t :1;
  uint16_t SPIRBEN:1;
  uint16_t SPIROVEN:1;
  uint16_t SRMTEN:1;
  uint16_t SPITUREN:1;
  uint16_t :2;
  uint16_t BUSYEN:1;
  uint16_t FRMERREN:1;
} SPI1IMSKLBITS;
extern volatile SPI1IMSKLBITS SPI1IMSKLbits __attribute__((__sfr__));

#define SPI1IMSK2 SPI1IMSK2
extern volatile uint16_t SPI1IMSK2 __attribute__((__sfr__));
__extension__ typedef struct tagSPI1IMSK2BITS {
  union {
    struct {
      uint16_t TXMSK:6;
      uint16_t :1;
      uint16_t TXWIEN:1;
      uint16_t RXMSK:6;
      uint16_t :1;
      uint16_t RXWIEN:1;
    };
    struct {
      uint16_t TXMSK0:1;
      uint16_t TXMSK1:1;
      uint16_t TXMSK2:1;
      uint16_t TXMSK3:1;
      uint16_t TXMSK4:1;
      uint16_t TXMSK5:1;
      uint16_t :2;
      uint16_t RXMSK0:1;
      uint16_t RXMSK1:1;
      uint16_t RXMSK2:1;
      uint16_t RXMSK3:1;
      uint16_t RXMSK4:1;
      uint16_t RXMSK5:1;
    };
  };
} SPI1IMSK2BITS;
extern volatile SPI1IMSK2BITS SPI1IMSK2bits __attribute__((__sfr__));

#define SPI1IMSKH SPI1IMSKH
extern volatile uint16_t SPI1IMSKH __attribute__((__sfr__));
__extension__ typedef struct tagSPI1IMSKHBITS {
  union {
    struct {
      uint16_t TXMSK:6;
      uint16_t :1;
      uint16_t TXWIEN:1;
      uint16_t RXMSK:6;
      uint16_t :1;
      uint16_t RXWIEN:1;
    };
    struct {
      uint16_t TXMSK0:1;
      uint16_t TXMSK1:1;
      uint16_t TXMSK2:1;
      uint16_t TXMSK3:1;
      uint16_t TXMSK4:1;
      uint16_t TXMSK5:1;
      uint16_t :2;
      uint16_t RXMSK0:1;
      uint16_t RXMSK1:1;
      uint16_t RXMSK2:1;
      uint16_t RXMSK3:1;
      uint16_t RXMSK4:1;
      uint16_t RXMSK5:1;
    };
  };
} SPI1IMSKHBITS;
extern volatile SPI1IMSKHBITS SPI1IMSKHbits __attribute__((__sfr__));

#define SPI1URDTL SPI1URDTL
extern volatile uint16_t SPI1URDTL __attribute__((__sfr__));
__extension__ typedef struct tagSPI1URDTLBITS {
  union {
    struct {
      uint16_t SPI1URDTL:16;
    };
    struct {
      uint16_t URDATA:16;
    };
  };
} SPI1URDTLBITS;
extern volatile SPI1URDTLBITS SPI1URDTLbits __attribute__((__sfr__));

#define SPI1URDTH SPI1URDTH
extern volatile uint16_t SPI1URDTH __attribute__((__sfr__));
__extension__ typedef struct tagSPI1URDTHBITS {
  union {
    struct {
      uint16_t SPI1URDTH:16;
    };
    struct {
      uint16_t URDATA:16;
    };
  };
} SPI1URDTHBITS;
extern volatile SPI1URDTHBITS SPI1URDTHbits __attribute__((__sfr__));

#define SPI2CON1 SPI2CON1
extern volatile uint16_t SPI2CON1 __attribute__((__sfr__));
__extension__ typedef struct tagSPI2CON1BITS {
  union {
    struct {
      uint16_t ENHBUF:1;
      uint16_t SPIFE:1;
      uint16_t MCLKEN:1;
      uint16_t DISSCK:1;
      uint16_t DISSDI:1;
      uint16_t MSTEN:1;
      uint16_t CKP:1;
      uint16_t SSEN:1;
      uint16_t CKE:1;
      uint16_t SMP:1;
      uint16_t MODE16:1;
      uint16_t MODE32:1;
      uint16_t DISSDO:1;
      uint16_t SPISIDL:1;
      uint16_t :1;
      uint16_t SPIEN:1;
    };
    struct {
      uint16_t :10;
      uint16_t MODE:2;
    };
  };
} SPI2CON1BITS;
extern volatile SPI2CON1BITS SPI2CON1bits __attribute__((__sfr__));

#define SPI2CON1L SPI2CON1L
extern volatile uint16_t SPI2CON1L __attribute__((__sfr__));
__extension__ typedef struct tagSPI2CON1LBITS {
  union {
    struct {
      uint16_t ENHBUF:1;
      uint16_t SPIFE:1;
      uint16_t MCLKEN:1;
      uint16_t DISSCK:1;
      uint16_t DISSDI:1;
      uint16_t MSTEN:1;
      uint16_t CKP:1;
      uint16_t SSEN:1;
      uint16_t CKE:1;
      uint16_t SMP:1;
      uint16_t MODE16:1;
      uint16_t MODE32:1;
      uint16_t DISSDO:1;
      uint16_t SPISIDL:1;
      uint16_t :1;
      uint16_t SPIEN:1;
    };
    struct {
      uint16_t :10;
      uint16_t MODE:2;
    };
  };
} SPI2CON1LBITS;
extern volatile SPI2CON1LBITS SPI2CON1Lbits __attribute__((__sfr__));

#define SPI2CON1H SPI2CON1H
extern volatile uint16_t SPI2CON1H __attribute__((__sfr__));
__extension__ typedef struct tagSPI2CON1HBITS {
  union {
    struct {
      uint16_t FRMCNT:3;
      uint16_t FRMSYPW:1;
      uint16_t MSSEN:1;
      uint16_t FRMPOL:1;
      uint16_t FRMSYNC:1;
      uint16_t FRMEN:1;
      uint16_t AUDMOD:2;
      uint16_t URDTEN:1;
      uint16_t AUDMONO:1;
      uint16_t IGNTUR:1;
      uint16_t IGNROV:1;
      uint16_t SPISGNEXT:1;
      uint16_t AUDEN:1;
    };
    struct {
      uint16_t FRMCNT0:1;
      uint16_t FRMCNT1:1;
      uint16_t FRMCNT2:1;
      uint16_t :5;
      uint16_t AUDMOD0:1;
      uint16_t AUDMOD1:1;
    };
  };
} SPI2CON1HBITS;
extern volatile SPI2CON1HBITS SPI2CON1Hbits __attribute__((__sfr__));

#define SPI2CON2 SPI2CON2
extern volatile uint16_t SPI2CON2 __attribute__((__sfr__));
__extension__ typedef struct tagSPI2CON2BITS {
  union {
    struct {
      uint16_t FRMCNT:3;
      uint16_t FRMSYPW:1;
      uint16_t MSSEN:1;
      uint16_t FRMPOL:1;
      uint16_t FRMSYNC:1;
      uint16_t FRMEN:1;
      uint16_t AUDMOD:2;
      uint16_t URDTEN:1;
      uint16_t AUDMONO:1;
      uint16_t IGNTUR:1;
      uint16_t IGNROV:1;
      uint16_t SPISGNEXT:1;
      uint16_t AUDEN:1;
    };
    struct {
      uint16_t FRMCNT0:1;
      uint16_t FRMCNT1:1;
      uint16_t FRMCNT2:1;
      uint16_t :5;
      uint16_t AUDMOD0:1;
      uint16_t AUDMOD1:1;
    };
  };
} SPI2CON2BITS;
extern volatile SPI2CON2BITS SPI2CON2bits __attribute__((__sfr__));

#define SPI2CON2L SPI2CON2L
extern volatile uint16_t SPI2CON2L __attribute__((__sfr__));
typedef struct tagSPI2CON2LBITS {
  uint16_t WLENGTH:5;
} SPI2CON2LBITS;
extern volatile SPI2CON2LBITS SPI2CON2Lbits __attribute__((__sfr__));

#define SPI2CON3 SPI2CON3
extern volatile uint16_t SPI2CON3 __attribute__((__sfr__));
typedef struct tagSPI2CON3BITS {
  uint16_t WLENGTH:5;
} SPI2CON3BITS;
